tsungreports/pumamicro_company/companypath1.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
<clients>
<client host="localhost" use_controller_vm="true" maxusers="50000"/>
</clients>
<servers>
<server host="ec2-52-25-228-42.us-west-2.compute.amazonaws.com" port="80" type="tcp"/>
</servers>
<load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="16" duration="30" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="32" duration="30" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
</load>
<options>
<option name="glocal_ack_timeout" value="2000"/>
<option type="ts_http" name="user_agent">
<user_agent probability="100">
Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4
</user_agent>
</option>
</options>
<sessions>
<session name="http-example" probability="100" type="ts_http">


        <setdynvars sourcetype="random_number" start="1" end="9999999">
                <var name="random_email_id"/>
        </setdynvars>
        <request subst="true">
                <dyn_variable name="edit_profile_url" re="Location: (http://.*)\r"/>
		<dyn_variable name="user_id" re="Location: http://.*/profiles/(.*)/edit\r"/>
                <http url="/users" version="1.1" method="POST" contents="user%5Bemail%5D=random_email_%%_random_email_id%%%40gmail.com&amp;     user%5Bpassword%5D=12345678&amp;     user%5Bpassword_confirmation%5D=12345678&amp;     user%5Bis_student%5D=false&amp;     commit=Sign+up">
                </http>
        </request>

	<request subst="true">
		<http url="%%_edit_profile_url%%" version="1.1" method="GET">
		</http>
	</request>

        <request subst="true">
                <http url="/profiles" version="1.1" method="GET">
                </http>
        </request>

        <thinktime random="true" value="1"/>

        <request subst="true">
                <http url="/contracts/new" version="1.1" method="GET">
                </http>
        </request>

        <thinktime random="true" value="2"/>
        <setdynvars sourcetype="random_number" start="20" end="1000">
                <var name="random_price"/>
        </setdynvars>

        <request subst="true">
                <dyn_variable name="contract_url" re="Location: (http://.*)\r"/>
                <http url="/contracts" version="1.1" method="POST" contents="contract%5Btitle%5D=test+contract+%%_random_email_id%%&amp;     contract%5Bcompany%5D=&amp;     contract%5Bpay%5D=%%_random_price%%&amp;     contract%5Bdeadline%5D=ASAP&amp;     contract%5Bdescription%5D=web+programming+helper+pls&amp;     skill_tag_name=&amp;     commit=Create">
                </http>
        </request>
        <request subst="true">
                <http url="%%_contract_url%%" version="1.1" method="GET">
                </http>
        </request>

        <request subst="true">
		<http url="/profiles/search" version="1.1" method="GET">
                </http>
        </request>

        <request subst="true">
                <http url="/profiles/search?utf8=%E2%9C%93&amp;search=ruby&amp;commit=Search" version="1.1" method="GET">
                </http>
        </request>

        <thinktime random="true" value="2"/>

        <request subst="true">
                <http url="/profiles/1" version="1.1" method="GET">
                </http>
        </request>
</session>
</sessions>
</tsung>